# Создание собственных модулей является важной частью разработки на Python и может принести множество преимуществ
# Файлы модулей в Python имеют расширение «.py». В этих файлах написан код на языке Python,
# которые могут содержать функции, классы, переменные, и другие составляющие программы.
# Модули используются для организации кода, повторного использования и распространения среди разных проектов и программ.
# Когда создается модуль, его имя становится именем файла без расширения «.py».
# Например, если создать файл модуля с именем «my_module.py», то имя модуля будет «my_module».
# Это имя будет использоваться при импорте модуля в других частях программы.






