# Создайте DataFrame структуры библиотеки Pandas из двух типов данных (словарей, и двухмерного массива numpy)
# из представленных ниже строк. Заполните пропущенные данные таблиц, а затем объедините между собой три таблицы
# с данными о населении крупных городов России.
# Удалите столбец ‘1971 год’ из таблицы городов, а в двухмерном массиве, полученного из numpy последнюю строку.
# Демонстрируйте выполнение задания на каждом этапе изменения таблиц
# Используйте предложенные строки для самопроверки своего кода.



import pandas as pd
import numpy as np


numpy_array = np.array([[11, 22, 33], [44, 55, 66], [77, 88, 99]])
data_dict1 = ({'Город': ['Москва', 'Санкт-Петербург', 'Новосибирск', 'Нижний Новгород', 'Самара', 'Омск'],
        '1971 год': [7945, 4073, 1312, 1344, 1198, 1014]})
data_dict2 = ({'Город': ['Москва', 'Санкт-Петербург', 'Новосибирск', 'Нижний Новгород', 'Самара', None],
        '2011 год': [11541, 4899, 1475, 1252, 1166, 1154]})
data_dict3 = ({'Город': ['Москва', 'Санкт-Петербург', 'Новосибирск', 'Нижний Новгород', 'Самара', None],
        '2023 год': [13104, 5600, 1635, 1213, 1163, 1110]})

df_numpy = pd.DataFrame(numpy_array, columns=['A', 'B', 'C'])
df1 = pd.DataFrame(data_dict1)
df2 = pd.DataFrame(data_dict2)
df3 = pd.DataFrame(data_dict3)
print(df_numpy)
print(df1)
print("-----------------------------------")
print(df2)
print("-----------------------------------")
print(df3)
print("-----------------------------------")
df2.fillna('Омск', inplace=True)
df3.fillna('Омск', inplace=True)
df_all = pd.merge(df1, df2, on='Город')
df_all = pd.merge(df_all, df3, on='Город')
print(df_all)
print("-----------------------------------")
df_all.drop('1971 год', axis=1, inplace=True)
print(df_all)
print("-----------------------------------")

last_row = len(df_numpy.index)
df_numpy.drop(last_row-1, inplace=True)
print(df_numpy)
print("-----------------------------------")